{
    "reviews": [
        {
            "userId": "1379DBEE1798F18B1D58FF6B0681F853",
            "id": "974393598",
            "text": "I don't live anywhere near a Shakey's so I took the opportunity to eat here on a recent Disneyland trip. It's a short walk from Disneyland and conveniently located near lots of hotels.\n\nShakey's is the first franchise pizza chain in the United States and has some cool history behind it. The pizza was good. They've got your standard variety but also several more unique pizzas. My son amd I each got our own small pizzas and both turned out good. \n\nThey were busy (lots of Disney folks coming in) but we got our food pretty quickly. I would eat here again when visiting Disneyland.",
            "locationId": 5089668,
            "title": "Good Pizza, Quick Walk From Disneyland",
            "rating": 5,
            "publishedDate": "2024-10-18",
            "username": "Travis G",
            "photos": [
                {
                    "id": 768751731,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2d/d2/38/73/caption.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 768751732,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2d/d2/38/74/caption.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "A08C3745B152AC9D129C0E7A254FA5AD",
            "id": "942831450",
            "text": "Store #052  @5:01 PM\n\nOur second visit over our holiday weekend. Busy place, that was a good sign for popularity equaling good food. The wait was off set by the shifts manager stepping up to make our visit better. Her excellent service, helpfulness & attitude made the 40 min wait for our pizza worth it.  She even offered a free side dish. That is what can make or break the chance of returning customers. Well Done.",
            "locationId": 5089668,
            "title": "Second time is the charm",
            "rating": 5,
            "publishedDate": "2024-03-18",
            "username": "DukeClay",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E2BE06BB8B4A6A97C39C0BDEA20AF62C",
            "id": "905130967",
            "text": "Okay. So I've been coming here every time we go on vacation to Disneyland, it's one of our favorite spots, service is top notch, food  taste the same as when I was a kid and the pizza, fried chicken and mojos (potato wedges) are super good. Today I was reminded that I should write a review about my experience with them, so that's exactly what I'm doing. Thanks \"Sandra\" for reminding me, hope this helps spread the word about Shakeys! Always 5 Stars",
            "locationId": 5089668,
            "title": "Classic!",
            "rating": 5,
            "publishedDate": "2023-07-23",
            "username": "True916",
            "photos": [
                {
                    "id": 701925869,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/d6/89/ed/caption.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "6B3FAD5CE4DB444C1C7E1F2A9128CA77",
            "id": "803954809",
            "text": "I have a been of Shakey's since I was a kid, and we had one near us which kept us in pizza for years. Now, it's gone and when I find a Shakey's somewhere where I am travelling I try to stop by for a revisit to my youth.\n\nI have been to this location before, as it is convenient to the hotels I stay at while in Anaheim. It is an easy to get to location, just off I-5 and Ball, with good parking and lots of room inside! Tonight the parking lot was getting full but there were plenty of tables inside in  spite of families, groups and couples enjoying a pizza night this Saturday. \n\nThe place is moving with business, and ordering took about a 5 minute wait - not too b ad considering. I was surprise to see the salad bar back! I haven't seen one of those anywhere since COVID hit! A nice surprise, which I took advantage of along with ordering a small vegetarian pizza. \n\nThe plate for the salad is about the size of a side salad, and for $7.99 I figure I needed two go-arounds to get my money's worth! It is all you can eat, so don't feel guilty going back. The lettuce was fresh and plentiful, with a choice of toppings that were basic - croutons, beets and olives, peaches, red onions, pepperoncini, and similar. But the sliced mushrooms were out, there were no tomatoes or cucumbers, so not everything I like was there. The dressings were filled, and I lava flowed the blue cheese over my salad. \n\nThey bring your order to the table, and when I was getting my second plate the pizza arrived. It took 26 minutes from ordering, but I was still on my salad so was not a distraction to me. I think that is a reasonable time for a busy night.\n\nThe drinks are self-serve, but both machines were out of ice! Oyyy. Not sure why, they seemed large  enough but I guess ice was the rage that night.\n\nI liked the pizza (original thin of course!) and the salad was nice - I hadn't had a salad in a while.  The young man taking the order was very nice, and the young lady who ran my pizza to my table came back after I had returned from the salad bar and was good enough to ask if I needed a plate - she could have just left the pizza and been done with me. \n\nIt was good to see them cleaning tables pretty quickly, and even giving the drink station a good cleaning and replenishment of straws and stuff.\n\nThe game arcade was really popular with kids and teens, too - it was the place of fun and luck. \n\nOverall a very good meal, and a reminder of why Shakey's is one of my favorites!",
            "locationId": 5089668,
            "title": "Very good dinner!",
            "rating": 4,
            "publishedDate": "2021-08-15",
            "username": "Mister-Markie",
            "photos": [
                {
                    "id": 496562935,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/f7/large-pan-pizza-with.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 496562917,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/e5/one-for-here-one-to-go.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 496562903,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/d7/small-vegetarian-pizza.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 496562895,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/cf/dining-room-ahead-another.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 496562882,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/c2/exterior.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 496562881,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/c1/my-dining-view.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 496562878,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/be/menu-boards.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "6DF989B552660D9991942E958E251FD7",
            "id": "752597180",
            "text": "The food was nice and hot and tasty as ever! We ordered the combo pepperoni pizza mojos and chicken.   The salad bar is too expensive for what they offer.",
            "locationId": 5089668,
            "title": "Chicken Pizza and Mojos soooo delicious but the salad bar is too expensive",
            "rating": 4,
            "publishedDate": "2020-04-13",
            "username": "MA9703",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "2AD68D8410DD84A4C23E4D977BD04073",
            "id": "743736865",
            "text": "Gluten-free Pizza No Go\n\nHe grew up on Shakey’s on Beach Blvd in La Habra with gay 1890s theme, silent B/W movies, cracker-like crust, and player piano. She few up in Sacramento where Shakey’s originated. Neither of us knew there were any still around. \n\nCalled in advance to confirm that they had gluten-free pizza crust. They said yes and suspiciously in all sizes. However, when we called back to order a pizza they said they do not offer a gluten-free crust at all. \n\nSo we got our gluten-free medium pizza from nearby Carolina’s instead. They say you can never go Home. Guess not. Too bad. ",
            "locationId": 5089668,
            "title": "Gluten-free Pizza No Go",
            "rating": 1,
            "publishedDate": "2020-02-08",
            "username": "NomadikCulture",
            "photos": [
                {
                    "id": 450207514,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/d5/9f/1a/photo0jpg.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "503A229882DA6B41E3098178A9520AA6",
            "id": "740276750",
            "text": "Chicken and mojo's are the saving grace here. Pizza is average at best. There's a small arcade for the  kids and beer for the adults. A lot of seating...",
            "locationId": 5089668,
            "title": "Good if you have kids - food is average",
            "rating": 3,
            "publishedDate": "2020-01-20",
            "username": "PROROB68",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E0C241ED99B2526EFDB2E930CE8E7B73",
            "id": "736032554",
            "text": "you will love the price and they have chicken and mash potatoes and gravy, really good with a great atmosphere",
            "locationId": 5089668,
            "title": "this is a great place to go to",
            "rating": 5,
            "publishedDate": "2020-01-01",
            "username": "markrs44mag",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "D2B991E9F95E6F1362FEDB4D81431998",
            "id": "726029370",
            "text": "Tem uma boa variedade de produtos, que são muito bem servidos. Atendimento meia boca, mas a gente releva...  pode ser uma diferença cultural",
            "locationId": 5089668,
            "title": "Bem servido",
            "rating": 4,
            "publishedDate": "2019-11-12",
            "username": "Cristiane C",
            "photos": [],
            "language": "pt",
            "is_translated": true,
            "translation": {
                "language": "en",
                "text": "It has a good variety of products, which are very well served.Half -mouth service, but we release it ... it can be a cultural difference",
                "title": "Well -served"
            }
        },
        {
            "userId": "144866E758479C07AEC5F13514C5EFE9",
            "id": "712822583",
            "text": "I have not been to a Shakey's in over 20 years when they closed on the East Coast.  Shakey's did not disappoint.  It's not the greatest pizza but it is good and quick.  It's a great place for the family.",
            "locationId": 5089668,
            "title": "Still a good place for good pizza.",
            "rating": 4,
            "publishedDate": "2019-09-25",
            "username": "John S",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "9423AD9D97DC350A8A34AF167170C3D1",
            "id": "697394639",
            "text": "日本では昔良く利用させて頂いたシェーキーズですが、今回初めてアメリカで食べました。\n\nたまたま宿泊したモーテルの真横がお店だったので。日本のお店と違って味がとても濃くて中々美味しかったです！",
            "locationId": 5089668,
            "title": "久々に シェーキーズでご飯",
            "rating": 4,
            "publishedDate": "2019-08-09",
            "username": "m2miffy",
            "photos": [
                {
                    "id": 414630927,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/b6/c4/0f/dsc-2663-largejpg.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 414630926,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/b6/c4/0e/dsc-2666-largejpg.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 414630925,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/b6/c4/0d/dsc-2664-largejpg.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "ja",
            "is_translated": true,
            "translation": {
                "language": "en",
                "text": "I used to eat Shakees in the past in Japan, but this was my first time eating it in the US.\n\nI happened to find a shop right next to the motel I stayed at.Unlike in Japanese restaurants, the flavor was very strong and it was quite tasty!",
                "title": "I've had dinner at Shakey's for the first time in a while"
            }
        },
        {
            "userId": "734D36BFFFF10516F16CCA9D267FF59B",
            "id": "696070433",
            "text": "Good pizza. I had a thin dough one, but the thick looked very appetising. Toppings were generous and dough was crispy. Friendly staff and fast service. A nice experience ",
            "locationId": 5089668,
            "title": "Good pizza",
            "rating": 4,
            "publishedDate": "2019-08-06",
            "username": "patrikc333",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "B84878D616BEB3C92AE605E6BF95C87A",
            "id": "690749286",
            "text": "We used to love going to Shakey's for their lunch buffet. Shakey's is no longer in our town. So we loved the opportunity to try it again. We ordered the Mojo Potatoes, Fried Chicken, and Pizza. The Mojo Potatoes used to be our favorite, and they are still as good as they have always been-excellent. Fried Chicken-Excellent. Pizza was very good. The Service was excellent. The Restaurant was in excellent shape. This will be a go to place when we come back to Anaheim.",
            "locationId": 5089668,
            "title": "Visited an Old Favorite",
            "rating": 5,
            "publishedDate": "2019-07-18",
            "username": "Don P",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "9BE83C1A91F9B2D02AE6644AD7E79A34",
            "id": "663293067",
            "text": "The employees were friendly. Recommend the buffet. Great price for all the food. Buffet had pizza and pasta!",
            "locationId": 5089668,
            "title": "Great Food and Service!",
            "rating": 5,
            "publishedDate": "2019-04-02",
            "username": "jpjim2019",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "83354D2DDDAD2C831588AE1C1DDA412E",
            "id": "660993735",
            "text": "We no longer have a Shakey's in our area. When ever we come to Southern California we look forward to the \"Bunch a Lunch\" Pizza, fried chicken, mojo potatoes, mac & cheese, salad bar... My favorite is the dessert pizza Pies.",
            "locationId": 5089668,
            "title": "Yaa Shakey's",
            "rating": 5,
            "publishedDate": "2019-03-25",
            "username": "lilnetjojocoxon",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E1BF8D6DCEE50E50E351686C7CBD699F",
            "id": "655326915",
            "text": "We placed an online order at 8:16 PM and it was supposed to be ready at 8:56pm. We showed up at 9 and it still wasn't ready, no worries, just running a little late, that's fine. We wait off to the side and that's when I noticed the cart of salad bar stuff just sitting there. Didnt think of anything at that moment. As we waited someone came to the counter angry because they waited over an hour and they still hadn't received their food. The workers apologized for the wait and said they were working on it as quickly as they could. We continued to wait and finally after waiting 40 minutes we finally got our food. Almost and hour after it was supposed to be ready and an hour and a half AFTER we ordered it. They apologized and gave us 2 large pizzas free on our next visit. It didnt do us any good because we were on vacation and weren't planning on wasting any more time there so we gave it to our maid at the hotel. The food was ok, not horrible buy definatly not worth 90 minutes of my families time. Last note, remember that salad bar cart I mentioned when we first came in? Yeah, it sat there untouched and was still there when we left. So take my advice, dont eat the salad bar.",
            "locationId": 5089668,
            "title": "Avoid unless you dont value your time or health.",
            "rating": 2,
            "publishedDate": "2019-02-27",
            "username": "maleficent84mfg",
            "photos": [
                {
                    "id": 379337630,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/9c/3b/9e/resized-20190220-211601.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "2254059862735F3DEDE5C1B1403BA93E",
            "id": "639935654",
            "text": "My family and I were in Anaheim for a few days and visited Shakey’s for dinner. Both my husband and I have fond memories of Shakey’s from our childhoods. Perhaps we just remember things as better than they actually were. Considering where we were, we had a hot meal and fed four adults from about $45. Not bad.\n\nWe ordered a large pizza and the family antipasto salad. Both were okay. ",
            "locationId": 5089668,
            "title": "Okay for the location",
            "rating": 3,
            "publishedDate": "2018-12-16",
            "username": "h_e_tompkins",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "CE99CC9B2BED8A13234C157C97D4DFB3",
            "id": "639790426",
            "text": "Clean and family friendly fun place to eat Italian. We had breast of chicken and pizza and both were delicious. We witnessed a lot of different group of people meeting to all eat together. Order your food and then go sit down at a table or both. Games for kids.",
            "locationId": 5089668,
            "title": "Nice variety of Food",
            "rating": 4,
            "publishedDate": "2018-12-15",
            "username": "Judy W",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "B92841421BF3FCA3E50D8CB7DCD059F6",
            "id": "635069197",
            "text": "Shakey's was in close walking distance from our hotel. We were looking for close and affordable pizza, they had a special so we decided to try them. The food and drink did not disappoint. We got a large pepperoni, a large Mojo (round jojo's) and a family salad. We had plenty to bring back to our hotel. It was also nice not paying double for a beer. The kids played games while the adults relaxed. Shakey's is a great place for everyone. 4/5 because our cashier was obviously new and was not ready for the dinner crowd. The manager walked around though to make sure everyone was happy.",
            "locationId": 5089668,
            "title": "Dinner after Disneyland ",
            "rating": 4,
            "publishedDate": "2018-11-22",
            "username": "Miczmama80",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "40B988CE40ED1689D50E310ED41C4C7F",
            "id": "622803206",
            "text": "After a long day traveling with kids, we ordered Shakey’s to enjoy with our family in the hotel.  The specials were confusing and overpriced, but we placed an order with three items.  After each item, we checked the option for a side of ranch.  The food arrived without any ranch.  If you are a person that counts on condiments, you can understand how disappointing it is to choke down dry food.  After paying too much for the food, a delivery fee of $5 and a tip, we expected our order to be right.  Neither Shakey’s nor Grub Hub responded to my complaint.  Paid way too much for dry food.  Order somewhere else.  Grub Hub reviews show that this is a common issue, which means that they truly don’t care about customer service.  Spend your money somewhere else!",
            "locationId": 5089668,
            "title": "Spend Your Money Somewhere Else!",
            "rating": 1,
            "publishedDate": "2018-10-06",
            "username": "suzannesW7870FS",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "5A7F8DBC96883F6FA61309C1C62E0E9B",
            "id": "619867469",
            "text": "We were excited when we saw Shakey’s.  We both have good memories from our youth.  Simply put this is not what you remember.  Dirty. Loud. Slow service. \n\nJust say no.  ",
            "locationId": 5089668,
            "title": "Not what you remember",
            "rating": 1,
            "publishedDate": "2018-09-26",
            "username": "BeulahMae",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "50775333AF8872CD930B91F578FFDB4C",
            "id": "608521435",
            "text": "Crispy, seasoned right, fresh.Even the mojos are crispier. \nNice clean dining area...convenient from Disneyland. \n\n",
            "locationId": 5089668,
            "title": "Best chicken I've had from a \"Shakeys\" ",
            "rating": 4,
            "publishedDate": "2018-08-20",
            "username": "sebastiansX7628HP",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "771C069A49EE0C6F6D835CBBAFBF0155",
            "id": "599983420",
            "text": "I was a birthday club member as a kid in the 70s in south Texas.  Sadly, in the early 80s, Shakey's closed.  Now, I only get this childhood treasure when I visit California.  So, I make sure to take the short drive from the magic of Disney up Harbor Dr to the magic of Shakey's.  This time, we arrived just about 5:30 pm, just beating the Friday night pizza crowd.  We ordered two large to go (back to the hotel).  Service was slow, but it gave us time to take photos and relive memories.  Giant large pizzas.  about $18 each.  But, we only have it about every 5 years, so it's not really expensive.  Ate on it for dinner, a midnight snack after more park time, and Monday breakfast before leaving back to Texas.  People back home were jealous when I posted pictures.  Not to worry, some lucky ones will get a souvenir napkin!",
            "locationId": 5089668,
            "title": "Childhood Dreams Relived at the Parlor",
            "rating": 4,
            "publishedDate": "2018-07-26",
            "username": "VDavis14",
            "photos": [
                {
                    "id": 333236467,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/dc/c8/f3/inside-wall-painting.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 333236544,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/dc/c9/40/boxes-staked-for-to-go.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 333236789,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/dc/ca/35/tada-look-at-that-cheesy.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 333236638,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/dc/c9/9e/the-box-with-a-treasure.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C77A08790371E3F9D891FA4A40A4F279",
            "id": "599574033",
            "text": "This was supposed to be a quick dinner for us but after being told that our food would be 15 to 20 minutes and then waiting 50 minutes and having to go to the counter twice we were finally served. The garlic bread was hard and not very appealing, the chicken strips were good and the pizza was very good. But, all things considered we won't eat here again.",
            "locationId": 5089668,
            "title": "Reasonable food but terrible service",
            "rating": 2,
            "publishedDate": "2018-07-25",
            "username": "sinnerman07",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "2AF5A26528CF8B2018863D0368F02F1C",
            "id": "599060302",
            "text": "Quick and easy place to stop after a long day at Disney.  Pizza here is delicious!  There wasn't many people in the place when we arrived and our order was ready in 15 minutes.  Definitely a good place to stop when you want a quick and good bite of pizza.",
            "locationId": 5089668,
            "title": "Best Pizza!",
            "rating": 5,
            "publishedDate": "2018-07-23",
            "username": "tm69tnt",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "822E3F1AA5F8140ECFCBEF66188EA841",
            "id": "595115228",
            "text": "Pizza was horrid! We had thick crust that was like 5cm thick and quite under cooked. The deals and choices are just far too confusing. Service was slower than slow. I think perhaps they were understaffed. Even if we had efficient service I would never set foot in this place again!",
            "locationId": 5089668,
            "title": "Just don’t go",
            "rating": 1,
            "publishedDate": "2018-07-10",
            "username": "katpirpinias",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "F8E47B8E64537BE11660B296635D2D66",
            "id": "594473167",
            "text": "I'm so glad we went here. My son loves Shakey's and we planned our trip from Washington so we could come here and not disappointed. Food was great(mojos could have been crispier) and service was great as well. Last year we went to a Shakey's in Brea and it wasn't food at all. This place however restored my faith. Thanks for a great meal and a great afternoon.",
            "locationId": 5089668,
            "title": "Great",
            "rating": 5,
            "publishedDate": "2018-07-09",
            "username": "kmello01",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "6BD5655A7E66040E8D25BDD7C7DF777E",
            "id": "593788172",
            "text": "Pizza so-so. We were there on a Friday and the place was a zoo. Better to order pizza ahead of time. Tables were left dirty and messy. Extremely noisy. I don't think we will return. ",
            "locationId": 5089668,
            "title": "Not Very Clean",
            "rating": 3,
            "publishedDate": "2018-07-07",
            "username": "Linda55555",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "600607E57E05ABEE31A21F59FCD249C8",
            "id": "591498209",
            "text": "We were looking for a good pizza place close by our hotel and this was right down the road. The pizza was delicious and the garlic breadsticks were delicious too. We ordered a meat lovers pizza and it was loaded and came out piping hot. We actually ordered a half size order for breadsticks but received a full order. I’d return there again for sure. ",
            "locationId": 5089668,
            "title": "Good pizza",
            "rating": 4,
            "publishedDate": "2018-06-28",
            "username": "Spacey N",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "2540E54FEAF84F709350945892022641",
            "id": "582735143",
            "text": "We used to go to Shakey’s all the time in Washington and then they all closed. We were at the Shakey’s in Anahiem about 18 years ago and finally got back there again last week and it was just as good as we remember. It is pretty crowded but lots of seating. Order at the window. Beer by the pitcher. The sausage they use on their pizza is the same as many years ago and it is awesome, we’ve never found that flavor anywhere else. We ate here after going to Disney Land..it’s fairly close by. Family friendly and good for adult and kids mix. They have an arcade with games. Bring $ if you have kids. ",
            "locationId": 5089668,
            "title": "BEST pizza! Shakey’s Special. ",
            "rating": 5,
            "publishedDate": "2018-05-25",
            "username": "BunnieinOregon",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "88D50707E4E04F94BBF1355F57B86097",
            "id": "580464412",
            "text": "Okay, it’s Shakeys, not The Ritz. The food was good but where they really shined is in their people.  We are vegetarians and they immediately volunteered to make cheese and veggie pizzas for us.  \n\nHalf way through the meal they checked in to see if we had enough to eat and to let us know they would make more vegetarian food for us. Unexpected service and very much appreciated.  Way to go, Shakeys!!!.  ",
            "locationId": 5089668,
            "title": "We got more than expected. ",
            "rating": 4,
            "publishedDate": "2018-05-15",
            "username": "ConVivo",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "97BA8C203747F85CA2D64E2DC96EB3FC",
            "id": "579138656",
            "text": "自分が思うジャンキー飯のアメリカ版ならこのシェイキーズピザ！サラミとチーズだけのシンプルだけど油っこくておいしい！コーク必須ですよ！みんなでワイワイ食べられる雰囲気です。",
            "locationId": 5089668,
            "title": "これぞジャンキー飯",
            "rating": 3,
            "publishedDate": "2018-05-09",
            "username": "ficklekorokoro",
            "photos": [],
            "language": "ja",
            "is_translated": true,
            "translation": {
                "language": "en",
                "text": "If you're thinking of Junkie Food, this is Shaky's Pizza!It's simple, just salami and cheese, but it's oily and delicious!Cork is a must!It's an atmosphere where everyone can eat together."
            }
        },
        {
            "userId": "D263AEF0F9096313C22578DE9FF1969A",
            "id": "568966698",
            "text": "There are many other things on the menu but I remember the pizza, salad and cinnamon puffs. We arrived as a very large group and Shakey's provided a pizza and salad bar. The food was fresh and it was kept stocked so everyone got fed quickly. The cinnamon puffs were just indulgent. Enjoy!",
            "locationId": 5089668,
            "title": "Tasty pizza, salad and cinnamon puffs",
            "rating": 4,
            "publishedDate": "2018-03-26",
            "username": "Jessica M",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "0AF39FF203A0402E3D8FE4CC819699BA",
            "id": "564472519",
            "text": "I had not been to this restaurant since I was a little girl.  No longer where I live.  Surprised that it has games and prizes.  They also had salad bar.  I ordered pizza and the potatoes.  They were delicious.  The pizza was as I remembered it.  It was a busy place for a Friday night, parties and families.",
            "locationId": 5089668,
            "title": "Great Potatoes!",
            "rating": 4,
            "publishedDate": "2018-03-04",
            "username": "SHERREE K",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "F31A507CE1BCF2A04DBA9F9925997AD5",
            "id": "558478806",
            "text": "Shakey's had a great Pizza, though  a bit pricey. But it is indeed value for money and very convenient as it is situated very close to the Parks.",
            "locationId": 5089668,
            "title": "Great Pizza ...",
            "rating": 4,
            "publishedDate": "2018-02-04",
            "username": "Mmabaledi S",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "1940300F1DE87DD98110D9A9468B1DDC",
            "id": "547521279",
            "text": "While in town on business, my coworkers and I decided to have the Lunch Buffet at Shakey’s Pizza on Harbor. We arrived slightly before the lunch crowd on a Tuesday and had no wait. \n\nThe restaurant was clean and inviting. The salad bar was fully stocked and good. The buffet was filled with fresh pizza, fried chicken, bread sticks, mojo potatoes, and a crispy dessert treat.  The food was very good and full of flavor. \n\nThe service was very good too.  Twice, employees came around to see if we needed anything.  I have great memories of the Bunch O’Lunch back from my childhood and this Shakey’s definitely lived up to what I enjoyed about it. \n\nEnjoy!",
            "locationId": 5089668,
            "title": "Great Lunch, Just Like the Old Days!",
            "rating": 4,
            "publishedDate": "2017-12-16",
            "username": "Jim G",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "6360CE1F627603CCD2A0F3482ECC55B8",
            "id": "543659425",
            "text": "This place is normally packed, so expect to wait a bit.  The Games are fun, but a little small and outdated.  Food is always good, best time to go is lunch for their buffet. ",
            "locationId": 5089668,
            "title": "Great Food, Slow Service",
            "rating": 4,
            "publishedDate": "2017-11-27",
            "username": "Jeff D",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E4AE16C88948B2F2648599719FBC8949",
            "id": "542333414",
            "text": "Went for the memories and the atmosphere and wasn’t disappointed.  Still good pizza and the place was packed.  Good staff",
            "locationId": 5089668,
            "title": "Memories",
            "rating": 4,
            "publishedDate": "2017-11-20",
            "username": "Darren M",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "BFD1436EE8C39431EF8D9953038309CA",
            "id": "496338577",
            "text": "This was more of a nostalgic visit than a necessity.  Shakey's was the spot to meet on a Friday or Saturday night.  Things have changed or at least I have changed.  Go for the memories. ",
            "locationId": 5089668,
            "title": "Pizza",
            "rating": 3,
            "publishedDate": "2017-06-26",
            "username": "Richard L",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "F1544126903F7D8DB51FED8E4BAE73AE",
            "id": "496280813",
            "text": "I have loved Shakeys Pizza for my entire life.  The Anaheim Shakeys will not disappoint you. The food is great and the service is fast.  It's worth the trip!",
            "locationId": 5089668,
            "title": "Favorite",
            "rating": 5,
            "publishedDate": "2017-06-26",
            "username": "Jeff C",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E6C57A1F38713F5D7A130A9B626FED7A",
            "id": "494951777",
            "text": "Memories are not generally lived up to by the present.  Not so with this venerable pizza joint. Great pizza, the best sauce and just right crust.  Same family night out vibe and the bonus really really good chicken.",
            "locationId": 5089668,
            "title": "An old friend just as good as ever",
            "rating": 5,
            "publishedDate": "2017-06-21",
            "username": "Mike R",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "DEA15370521AEE92563BB68CC707D223",
            "id": "481322983",
            "text": "I hadn't been to a Shakey's in years. I had a great pizza and my wife enjoyed the salad bar. There was a small recreation area for the kids to play. It was an enjoyable stop in my Disney vacation.\n",
            "locationId": 5089668,
            "title": "Fun throwback",
            "rating": 5,
            "publishedDate": "2017-05-03",
            "username": "bigbadbuyer",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "7EF0FAFB84BD9012D44264A1164204CA",
            "id": "469632300",
            "text": "Really nice to see a Shakey's.  Love love love the mojos.  Staff was very helpful.  Sure enjoyed getting to eat at an old favorite of mine.",
            "locationId": 5089668,
            "title": "Old favorite",
            "rating": 5,
            "publishedDate": "2017-03-23",
            "username": "Kim J",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "95F3AA0A0EEEC70DD53B20E5F083794B",
            "id": "467637851",
            "text": "The wife and I both grew up going to shakeys as kids we both got moved by family to Arizona so we both always talked about mojo potatoes. So when we had our own family we decided we would visit on our vacation. We went to another location and mojo potatoes let us down. We then returned to a couple other shakeys and again let down. Well this vacation we were all hungry and tired and after walking out of roscoes we were on our way to Paul's place and we all were thinking by the time we eat we are gonna be so tired so we saw this shakeys next to Disneyland 5 minutes from our hotel and said why not. Happy to say we finally got what we were looking for. Great service food was great and of course mojo potatoes were excellent! We will be back in June for some more!!",
            "locationId": 5089668,
            "title": "It was shakeys last chance....",
            "rating": 4,
            "publishedDate": "2017-03-15",
            "username": "rmartinez135",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "F2C482DE69C33BE01F5CD83702722A0E",
            "id": "465307875",
            "text": "Great pizza and chicken. The kids enjoyed the arcade games. The service was a bit slow, but the cheese piza was so good!",
            "locationId": 5089668,
            "title": "Yum!",
            "rating": 5,
            "publishedDate": "2017-03-07",
            "username": "sandeelee",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "D713F168A5AD1A431EF5879059805ABA",
            "id": "455527010",
            "text": "I think we can get better products for the price...I don't like the flavors costumer services can be better too...",
            "locationId": 5089668,
            "title": "Can be better",
            "rating": 2,
            "publishedDate": "2017-01-28",
            "username": "Gaby V",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "9702BBBC62ABB09B2FAD230F6F7BE52D",
            "id": "454416659",
            "text": "Visited twice while in LA.  Their pizza is really good and their beers are great too.  What more do you need after a long day wandering round LA?",
            "locationId": 5089668,
            "title": "Love Their Pizza",
            "rating": 5,
            "publishedDate": "2017-01-23",
            "username": "TheBigTravelBoss",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "7F78340FE8853BACAAA159EDE708BD3D",
            "id": "446376881",
            "text": "My husband and I grew up with Shakey's (not this location but it's the same). We were happy to learn that Shakey's was still operating after all these years. It's great to have lunch, taking a break from Disneyland. It's easy to get to and the best part is the lunch buffet. It includes chicken, potatoes, spaghetti, rice, salad bar, garlic bread. Great value. The food tastes yummy. We were at Disneyland for two days and this is where we ate both days. Take a break from the park and come enjoy a meal here!",
            "locationId": 5089668,
            "title": "Love!",
            "rating": 4,
            "publishedDate": "2016-12-23",
            "username": "debbiedavemesa",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E9E6EFED0B12F81B71B1F91E97753AD3",
            "id": "444923997",
            "text": "Enjoyed Shakey's last night for dinner. Enjoyed a cheese pizza. The service was quick even though they were packed ",
            "locationId": 5089668,
            "title": "Enjoyed a cheese pizza",
            "rating": 4,
            "publishedDate": "2016-12-17",
            "username": "WB1984",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "73B91FE65C02241D8BB2B8B085B71CE5",
            "id": "434454690",
            "text": "I'm not a big fried chicken person, but I thought shakeys was really good, along with their mojos. I didn't care for the pizza but my husband liked it. ",
            "locationId": 5089668,
            "title": "Great chicken",
            "rating": 5,
            "publishedDate": "2016-11-03",
            "username": "Anna E",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "39A05C6AC251583804DFF13C00889D18",
            "id": "428851071",
            "text": "Whenever we visit Disneyland, my husband makes sure we go to Shakey's.  He grew up going there and has always loved it.  The pizza is great...nothing too fancy like so many places.  Just traditional pizza that everyone likes.  The fried chicken and mojo potatoes are excellent.  We always make sure to get an order of the mojos with ranch. The atmosphere is fun with a game room and televisions all around.  It isn't too far from Disneyland but far enough that you feel like the prices are reasonable.",
            "locationId": 5089668,
            "title": "Great family restaurant",
            "rating": 5,
            "publishedDate": "2016-10-17",
            "username": "SonnyCat",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C0D68E992E4410BF3C31EB424C2B760A",
            "id": "427347173",
            "text": "We ate here when staying at Hotel Menage, down the road.\n\nThe food seemed well priced and was tasty.\n\nIt's nothing fancy, but good for a meal when travelling.",
            "locationId": 5089668,
            "title": "Good honest food",
            "rating": 4,
            "publishedDate": "2016-10-12",
            "username": "Nedbedrock",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "7A40D56F57C9C82DC4C9E0C6E67983F6",
            "id": "425030278",
            "text": "They pizza was made fresh and hot when order. There was lots of topping on the pizza. The service was very good. I did a take out order when the pizza was done the employee open the pizza box to make sure that I was happy with the order. Nice Touched.",
            "locationId": 5089668,
            "title": "Pizza Place",
            "rating": 4,
            "publishedDate": "2016-10-04",
            "username": "Kenny C",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "668FDEF4B7B6A011F40BEF8F16DDC4E2",
            "id": "423367211",
            "text": "It's nice the happy hour is pretty good but the service can be slow @ times is a busy location with allot of tourists because of its proximity to Disneyland Resort. They have the buncha lunch buffet. It gets crowded fir football because of the NFL package. Worth visiting if you aren't hard to please or are looking for a place to take a large group.",
            "locationId": 5089668,
            "title": "Newly renovated with allot of Televisions",
            "rating": 3,
            "publishedDate": "2016-09-28",
            "username": "Mr D",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C45633E497716BF7035EA932EC327A78",
            "id": "419902480",
            "text": "Nic odkrywczego, ale trzymają poziom. Zmieściliśmy się sporą grupką, w pobliżu stacja benzynowa. Blisko hotelu.",
            "locationId": 5089668,
            "title": "Szybkie jedzenie.",
            "rating": 3,
            "publishedDate": "2016-09-18",
            "username": "MichTW",
            "photos": [],
            "language": "pl",
            "is_translated": true,
            "translation": {
                "language": "en",
                "title": "Fast food."
            }
        },
        {
            "userId": "3BAE0B9F1735156E255BEBE0422ECF5F",
            "id": "419323849",
            "text": "Enjoyed Shakeys as a kid so we went to dinner.  Had single pizzas and the salad bar.  Salad bar needed to have a few items refilled.  If you have kids they have games available.  We watched Thursday night football.  We will eat here when we are in town.",
            "locationId": 5089668,
            "title": "Dinner ",
            "rating": 4,
            "publishedDate": "2016-09-16",
            "username": "Randy T",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "BD7B3ED0BCC82D89C037EE1A21C7A7E3",
            "id": "415787086",
            "text": "My husband wanted to take me and our boys here as he used to eat Shakey's when he was a kid. He was disappointed when we ordered our food and it was so expensive. For 1 pizza, 1 salad bar, 12 wings and garlic bread it was $75 and that is extremely overpriced. Our sons enjoyed the game room but that was about the only good thing. The restaurant is super cramped and over priced.",
            "locationId": 5089668,
            "title": "Fun Environment",
            "rating": 3,
            "publishedDate": "2016-09-07",
            "username": "maegenr2015",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "5C88F6CD5F2E89864865B0E2AB3CCF38",
            "id": "404267734",
            "text": "While it is dirt cheap, this place was very disappointing. I should have taken the hint from the empty parking lot. \n\nSalad bar was bone dry basic: lettuce, tomatoes,shredded carrot, corn, and a few other basic items, including the usual basics. \n\nThe personal pizza had one small piece of ham and one slice of mushroom per slice. Dismal, to say the least. \n\nTaste was merely OK. \n\nThere were maybe 10 people in a room that accommodates around 250, split among 3 tables. \n\nI left feeling like I should have looked harder for a place to eat lunch. \n\n",
            "locationId": 5089668,
            "title": "Steer clear",
            "rating": 2,
            "publishedDate": "2016-08-11",
            "username": "Daiverman",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "858AC7C66267BDACA8AD5FD2E7359BC4",
            "id": "397410724",
            "text": "Food was really good and reasonably priced.  It was a good place to go from Disney for a break. I would recommend.",
            "locationId": 5089668,
            "title": "Family Vacation",
            "rating": 5,
            "publishedDate": "2016-07-26",
            "username": "123Denice",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "80A42B23CA20DB44BACE59E2C5C69FF4",
            "id": "396316119",
            "text": "Good family restaurant went for lunch buffet on a Sunday buffet was packed, everything was great staff was friendly not a wait for fresh food",
            "locationId": 5089668,
            "title": "Great for price",
            "rating": 5,
            "publishedDate": "2016-07-24",
            "username": "Chanel S",
            "photos": [
                {
                    "id": 204853647,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/35/d1/8f/20160724-115515-largejpg.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "002FBE41241EDEEF1C3D0D6EE6FC0A28",
            "id": "395531926",
            "text": "Shakey's was right next to our RV park. The food was very good. The service was prompt. The area clean. ",
            "locationId": 5089668,
            "title": "PIZZA!!",
            "rating": 4,
            "publishedDate": "2016-07-22",
            "username": "Sally C",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C2F365482EAE47F3215CBB5F065BC915",
            "id": "387236628",
            "text": "This is the first time we eat at Shakeys here in the States.  I grew up in Manila, Philippines so I'm used to Shakeys growing up.  I won't forget the pizza, chicken and mojos.  To this date the chicken and mojos are still the best! The salad bar should close or at least update the food choices.  The addition of game room in the area is a good idea for family with little kids and kids are heart.  The staff tried their best to clean the area ( ate around 8pm).  The staff are very nice and attentive.",
            "locationId": 5089668,
            "title": "Chicken and mojos still the best ",
            "rating": 3,
            "publishedDate": "2016-06-28",
            "username": "dadaforcks",
            "photos": [
                {
                    "id": 197543726,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0b/c6/47/2e/photo0jpg.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "F8C930964C043B7DFB2D7C3FCFA2AAC2",
            "id": "379810368",
            "text": "Our 1st time in this \"chain\" restaurant and was pleasantly surprised. Saturday lunch 2 adults/2 kids only cost $40 and it was unlimited pizzas, salads, chicken, spaghetti,mojo potatoes,mashed potatoes,mac and cheese, salad bar",
            "locationId": 5089668,
            "title": "good food for price",
            "rating": 4,
            "publishedDate": "2016-06-04",
            "username": "Nancy M",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "311C3BFE7B54D793199923D50680974E",
            "id": "376569979",
            "text": "Great place to grab a quick bite to eat after a long day at the Disney parks. Pizza was fresh and very delicious. ",
            "locationId": 5089668,
            "title": "Pizza",
            "rating": 5,
            "publishedDate": "2016-05-25",
            "username": "Wednesday S",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "ADD8753BC3DF989CE966E344BCCB0112",
            "id": "375970626",
            "text": "We were not expecting such a great evening.  The food was excellent, the drinks were good & the kids absolutely loved all the games & winning so many tickets they got to pick out their prizes.  The price was excellent too so a great value for an evening out for dinner. The portions are huge so plan accordingly.  I had the salad bar & it was excellent & cheap. Was walking distance to where we were staying so that was a big plus!",
            "locationId": 5089668,
            "title": "What a nice surprise!",
            "rating": 5,
            "publishedDate": "2016-05-23",
            "username": "girlieduke",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "AD21BAFCD06B5406A48A5CBC352A4EEF",
            "id": "357201813",
            "text": "Breakfast taken care of in the Hotel, and Pizza dinner at Shakeys,...Really good valae Pizza, and likely, the best Pizza I have ever eaten,......And a huge jug of Stella for $15, what more could you want ,....Their restaurant is well patronised , however , because it was busy,......the ordering counter struggles to keep up ,.....But the wait was well worth the food....Chris & Ray,...Auckland NZ..",
            "locationId": 5089668,
            "title": "Best value pizza, for Disneyland visitors",
            "rating": 4,
            "publishedDate": "2016-03-20",
            "username": "aultz",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C5B8D2AB1D0CB170935639C4C2966FFE",
            "id": "341813706",
            "text": "We were thrilled to run across a Shakey. The pizza is still great! You can even have chicken and potatos while the kids play games.",
            "locationId": 5089668,
            "title": "Great Pizza",
            "rating": 5,
            "publishedDate": "2016-01-21",
            "username": "Steven W",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "3D5FDE49BACCB97927C6A0A38628B4BB",
            "id": "341245146",
            "text": "The kids enjoyed the arcade while we enjoyed the atmosphere, hot pizza, cool salad bar and beer!  The prices are a little higher than what I expected, but overall it was a good choice for dinner and the service was fast and friendly!",
            "locationId": 5089668,
            "title": "Great pizza & salad bar",
            "rating": 4,
            "publishedDate": "2016-01-19",
            "username": "ChristinaWard_2012",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "D736BA523CF0C8AA29E0D1A99ED757CB",
            "id": "329594058",
            "text": "The arcade was a little disappointing but the staff is nice and the pizza is pretty good. They have a decent salad bar, as well. ",
            "locationId": 5089668,
            "title": "Not bad.",
            "rating": 3,
            "publishedDate": "2015-11-28",
            "username": "Laura B",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "7EA9BA3339676751375092689B1F178B",
            "id": "328704029",
            "text": "We came back from a day at Legoland and I recalled another hotel guest stating they were going to a Shakey's Pizza near our hotel. I went to a lot of birthday parties and friends eat out parties at Shakey's as a child and even up to my College days when we went for the cheap Pizza and Beer pictures with friends/parties. Not sure exatly when Shakey's change for the \"old time\" style Pizza, B & W movies, player piano, etc, to what it is today. Only thing I recognized was some of the old time signage. \n\nPizza is not great. Salad bar is a joke for what they charge and ours was a mess. Not looking well stocked or hygienic. CiCis Pizza does a better job on its pizza and salad bar.  Up side was flat TVs allowed us to watch some NFL.",
            "locationId": 5089668,
            "title": "Not the cool place I remember as a kid",
            "rating": 3,
            "publishedDate": "2015-11-23",
            "username": "TallTex_Austin",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "52DF789A24E413D8B08D5390E813925F",
            "id": "328596088",
            "text": "I took my family to this restaurant and we loved it!  The Pizza and Mojos were great and the kids loved the arcade area.",
            "locationId": 5089668,
            "title": "Great Pizza!",
            "rating": 5,
            "publishedDate": "2015-11-23",
            "username": "Bryan W",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "CE5834F933CB80B4B841627A2603D0EE",
            "id": "317396810",
            "text": "If was great to not eat at Disneyland everyday and eat here as an alternative.  Good selection of food.  We will be back!",
            "locationId": 5089668,
            "title": "Great place to eat!",
            "rating": 4,
            "publishedDate": "2015-10-09",
            "username": "val2323",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "84FA7829818A30949E762C608A867502",
            "id": "314312583",
            "text": "This place was right next to where we were staying and just decided to go there because it was easy. It ended up being great! Really good pizza at good prices. \n\n",
            "locationId": 5089668,
            "title": "So good!",
            "rating": 5,
            "publishedDate": "2015-09-28",
            "username": "Rhi J",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C75368F1A3712F03105F8C4A1BACC9C7",
            "id": "314035955",
            "text": "Went here since it was close to the hotel. As a pizza joint I expected to get a pizza, but noticed a good deal on a chicken and mojo potatoes, so went that way.\nService was nice with a smile and that the chicken was a good choice. Very pleased with the portion size and the flavor and it not being greasy. Mojo potatoes are nice and crisp and again not greasy. When I go back to the area I will definitely visit again. ",
            "locationId": 5089668,
            "title": "Great chicken and mojos",
            "rating": 4,
            "publishedDate": "2015-09-27",
            "username": "Rexster555",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "E62798A3A2FAF48B73686759AACFCC18",
            "id": "313494720",
            "text": "Where do to a 4 year old that's fun besides Chuck E. Cheese???\nShakey's smaller scale arcade games but fun and great tasting pizza and yes prizes too!\nNice staff and did i say good pizza!!!!",
            "locationId": 5089668,
            "title": "Fun dinner with Grandson",
            "rating": 4,
            "publishedDate": "2015-09-25",
            "username": "Tina B",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "218E665DA2AA64CBDA41F8AECF11C709",
            "id": "313170220",
            "text": "The place was packed which reflects good service and food. Clean and had an area for children to play video games and accumulate couptons",
            "locationId": 5089668,
            "title": "Excellent pizza and fun times for the kids",
            "rating": 5,
            "publishedDate": "2015-09-23",
            "username": "Pam H",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "A6FB7049180ED765612DA1FF201389B5",
            "id": "308967887",
            "text": "Was visiting Disney and wanted to get our best bang for our buck since we spent money as Dland.  This place is just down the street from Disneland.  Better to drive than walk if you are staying in a hotel around the resort.  Just a 2 minute drive over the overpass on Harbor.  We got the family meal that consist of a large Pizza and some Friend chicken.  No chicken wings, but pieces of Chicken.  And it was good.  Has a little arcade for the kids and large screen TV's for watching the games.  Looks like a place to go after a Angel's game as we saw some fans in their Halos gear.  But this place had it share of out of towners on vacation.  Thumbs up!",
            "locationId": 5089668,
            "title": "Great food and place to eat after Disney",
            "rating": 4,
            "publishedDate": "2015-09-10",
            "username": "Fredrock",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "B82527EF199F9D3B3C15AAF69EFF5541",
            "id": "304661196",
            "text": "Real nice place. We went during the lunch time. Price was right and the food at the buffet was awesome. My favorite was the chicken. Our son said the pizza was great and loved all the activities.",
            "locationId": 5089668,
            "title": "California vacation",
            "rating": 5,
            "publishedDate": "2015-08-29",
            "username": "Rose R",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "1B5E489DDF913491A38CA31DF172EFF9",
            "id": "304470939",
            "text": "I used to go to Shakey's all the time in my younger days. I thought I would try this one to see if it was like I remember. The atmosphere was about the same. Instead of those fun black and white silent movies they now sport big screen TVs. The real test is, of course, the pizza. Shakey's had a very distinctive crust and sauce. Sadly the distinctiveness has gone with the movies. The pizza is fine and tastes good. It just isn't the classic Shakey's thin pizza. I remember they would write on little pieces of foil when you ordered and you could look through a window to see them make the pizza. This ones kitchen is an \"obstructed view\". The food was fine and the people were nice an friendly. ",
            "locationId": 5089668,
            "title": "Not the Shakey's of ole",
            "rating": 3,
            "publishedDate": "2015-08-28",
            "username": "Seavapor",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "25948ED2E67F02717EFDBF4E18FD4385",
            "id": "292899107",
            "text": "We first had Shakeys pizza for dinner one night it was yummy. While in there picking up pizza I notice all u can eat lunch so we went back one day to try this. This was awesome value yummy salads vegetables pizzas fried chicken pastas wedges mash & dessert pizza. My kids loved it as well the food was enjoyed along with the arcade of games they played while we are more. highly recommend all u can eat lunches. ",
            "locationId": 5089668,
            "title": "Lunch while on holidays",
            "rating": 5,
            "publishedDate": "2015-07-27",
            "username": "Ernie2107",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "F19903D021A8ABABF302BEE217371EC3",
            "id": "291851877",
            "text": "Fun for kids. They have arcades there but the service isnt that amazing. The food is pretty good though and they have a good lunch. ",
            "locationId": 5089668,
            "title": "Good food",
            "rating": 4,
            "publishedDate": "2015-07-23",
            "username": "Mishel37",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "EBF3FA0BCE5E289BBD04EEAB5182D30B",
            "id": "291642821",
            "text": "We're from Northern CA, unfortunately we no long have a Shakey's in our area, so whenever we are in town this is usually our first stop. And usually another trip before we head home!!\nThe food was as we remember'd it, the staff were very nice & attentive!!",
            "locationId": 5089668,
            "title": "A must have when in Anaheim !!",
            "rating": 5,
            "publishedDate": "2015-07-22",
            "username": "DMendoza704",
            "photos": [
                {
                    "id": 141474252,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/6e/b9/cc/absolutely-love-shakeys.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 141474253,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/6e/b9/cd/absolutely-love-shakeys.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 141474255,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/6e/b9/cf/absolutely-love-shakeys.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 141474262,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/6e/b9/d6/absolutely-love-shakeys.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "07F207AB3CA03EBF46F4AE19BB6FFB7F",
            "id": "287590662",
            "text": "everytime we travel to anaheim (disneyland), we make it a point to eat here every time. we love their mojo's and pizza!",
            "locationId": 5089668,
            "title": "a must go",
            "rating": 5,
            "publishedDate": "2015-07-10",
            "username": "Mark D",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "CD7F6B163FDAA082340F5A7DCF57D36E",
            "id": "284596243",
            "text": "pizza here was okay at best.not much flavor.i did enjoy the fried chicken.the salad bar was a mess not full and wilted brown lettuce. staff was not very Friendly  or helpful at all.",
            "locationId": 5089668,
            "title": "not the shakeys from the past.",
            "rating": 3,
            "publishedDate": "2015-06-30",
            "username": "Steve T",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "17FEFB550CD9B25BCBB99E3F7D74A788",
            "id": "274933571",
            "text": "The food was amazing, the service was spot on and the price was value for money. I only had the plain cheese pizza but it was delicious. Definitely would recommend",
            "locationId": 5089668,
            "title": "Great food, great Service",
            "rating": 5,
            "publishedDate": "2015-05-26",
            "username": "dabrownguy",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "1F2160D6A43AFCA4C1F94C12EC1B2D87",
            "id": "272978089",
            "text": "Abysmal place. Wouldn't eat here again if someone else was paying. Food and service were both terrible.  ",
            "locationId": 5089668,
            "title": "Evening food",
            "rating": 1,
            "publishedDate": "2015-05-19",
            "username": "D.N A",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "76D7947406A287CC86F4B42D0989306C",
            "id": "272076713",
            "text": "Slowly, the Shakey's Pizza Parlors that I loved growing up are closing down.  Much to my surprise during our recent visit to Disneyland, we found one of the original Shakey's in Anaheim.  It was just as good as I remembered it.  We visited the buffet.  Unlike other pizza buffets, there was plenty of pizza, bread sticks along with other food items such as chicken, pasta, vegetables and a great salad bar.  I hate that we live so far away or we would be there every week!  Very clean",
            "locationId": 5089668,
            "title": "Still the Best Pizza!!",
            "rating": 5,
            "publishedDate": "2015-05-14",
            "username": "Julikins55",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "284CB354E8F0B366ECC674A4B89B6FF7",
            "id": "269393627",
            "text": "We got a combo deal with pizza, chicken and ordered a couple smoothies too. The food was decent, if overpriced. $32 for a medium pizza and 2 smoothies? Now..about the smoothies.. They came in a paper cup, just over half full. They charged us $3.49 each and for that I think we were specifically overcharged. The presentation sucked. The taste was good though. This was a lot like unwrapping a paper bag and finding a couple jewels mixed with a couple golf balls.",
            "locationId": 5089668,
            "title": "Decent",
            "rating": 4,
            "publishedDate": "2015-05-01",
            "username": "Photoguy505",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "131DA53E50DF28D18FB586BFAD5D4618",
            "id": "259415832",
            "text": "Shakey's Pizza was a great spot for dinner.  Nice selection of beers to accompany the meal.  Very Good Service.\n",
            "locationId": 5089668,
            "title": "Great spot for dinner",
            "rating": 5,
            "publishedDate": "2015-03-14",
            "username": "Boxler",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "45493077E0A3CDB51FAD326A71468D71",
            "id": "258150872",
            "text": "To be fair I have great memories of eating at Shakey's Pizza when I was growing up - there was a franchise in my home town in Edmonton, AB when I was a kid, and I still remember my disappointment when it shut down.\n\nSince that time I have taken advantage of every available opportunity (read that as \"trip to California\") to relive my childhood by hitting Shakey's.  Finding this one so close to Disney was just fantastic.\n\nPlease note that this may not be the fanciest restaurant, but the food is very good, and the pizza has a nice thin crust.  The Mojo Potatoes have been my favorite since I was a child, and my own kids seem to agree.  Its nice and close to the Disney parks, reasonably priced, and overall a good value.  I recommend signing up on their website as they will send you coupons by email.",
            "locationId": 5089668,
            "title": "A great meal fueled, in part, by nostalgia",
            "rating": 5,
            "publishedDate": "2015-03-06",
            "username": "Duncan M",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "A3295C358B4DB1EB1C44D58CD5D23F93",
            "id": "252130992",
            "text": "Our family of 4 visited one night after a day at Disney parks.  Bought one of the family meals that included pizza, fried chicken and Jo's.  The pizza was good, classic crispy thin crust.  The fried chicken was unbelievable, the skin was crisp and light, perfectly cooked and seasoned.  Great family meal.",
            "locationId": 5089668,
            "title": "Great Fried Chicken",
            "rating": 4,
            "publishedDate": "2015-02-01",
            "username": "Susan W",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "686160B2E59E2ECA5C31ACC4ACAFDBA4",
            "id": "251691376",
            "text": "I always went for buffet lunch, which they served daily between 11am and 2pm, below $10. Healthy range including rice, pasta, tomato sauce, chicken, fried and mashed potatoes, vegetables and pizzas. Nice environment and delicious food.",
            "locationId": 5089668,
            "title": "Healthy & Tasty Buffet",
            "rating": 4,
            "publishedDate": "2015-01-29",
            "username": "NIMOTA I",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "C5E72B99B11B1FE3570CD6A50CB913E7",
            "id": "250380565",
            "text": "Large and busy canteen style Pizza place.  You order at the cashier and then find a table.  good selection and the Pizza was fine, great if you are in a hurry.",
            "locationId": 5089668,
            "title": "Basic value Pizza",
            "rating": 3,
            "publishedDate": "2015-01-21",
            "username": "Gmount1",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "851DD074BB963A4696BC4694C6E00E54",
            "id": "241485232",
            "text": "The food was great but nearly all the games were out of service but had no sign indicating it so my daughter couldn't play much. Since the signs were not on the machines saying out of order so we wasted a lot of money because no one was working that area",
            "locationId": 5089668,
            "title": "Great Food but...",
            "rating": 2,
            "publishedDate": "2014-11-25",
            "username": "Marisa M",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "5BFF54E7C640D33FEAEFD49210E06AF5",
            "id": "241184973",
            "text": "We just visited Shakey's and we had some great pizza! The place has so many TV's and loud music, that I would like had it not been overbearing. I wish the noise level was less, but I will still go back again, and just hope for the best.",
            "locationId": 5089668,
            "title": "Great pizza, loud atmosphere....",
            "rating": 4,
            "publishedDate": "2014-11-23",
            "username": "Sara K",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "048F82DE5BC500EDFCFE530626CD71ED",
            "id": "240621616",
            "text": "Went here on a Monday night..wow very busy.. We ordered food and got it pretty fast! Place was nice & clean, staff was courteous. Just one thing we ordered wings and was asked twice what kind of sauce & the guy still brought us the wrong sauce.. So for that 1 star off!! Overall love this place!!",
            "locationId": 5089668,
            "title": "Shakey's.. Why not?! ",
            "rating": 4,
            "publishedDate": "2014-11-19",
            "username": "Disneymommy09",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "9595D9BC8F4A08F929BB23966E630F48",
            "id": "239684914",
            "text": "Shakey's is the last remnant of the old fashioned pizza places we frequented as a kid.  Even though their baking methods have modernized, the pizza still tastes nearly the same.  And who can pass up BUNCH O LUNCH??",
            "locationId": 5089668,
            "title": "Made me feel young again!",
            "rating": 5,
            "publishedDate": "2014-11-13",
            "username": "Kevin W",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "CA4CE3A5A56DC06E2E7B05097367C1FB",
            "id": "236281430",
            "text": "Disorganized, poor management, lousy service. Took an hour to get a take out pizza and garlic bread. Lots of people complaining.",
            "locationId": 5089668,
            "title": "Worst service ever!",
            "rating": 1,
            "publishedDate": "2014-10-25",
            "username": "Bbumh",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "22D066CDA2006CFF873C483990691EDD",
            "id": "232886355",
            "text": "We had the lunch buffet....good selection and they kept the buffet full of different kinds of pizza.  There was also chicken, salad and potatoes.  ",
            "locationId": 5089668,
            "title": "Good Value/Pizza",
            "rating": 4,
            "publishedDate": "2014-10-06",
            "username": "drandys102",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "B27BB4078A4E37886FB3CF01713D8537",
            "id": "232732255",
            "text": "I've eaten at my fair share of Shakey's over the years, this one is particularly clean and well kept.  The food was extremely fresh, though I'd did arrive right at opening so that should be expected!   Overall this is possibly the best location I've been to of the chain. ",
            "locationId": 5089668,
            "title": "Maybe the cleanest one I've ever been in!",
            "rating": 4,
            "publishedDate": "2014-10-05",
            "username": "DoubleOIncognito",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "AF93098D2F3DFD4E8422203AC8296418",
            "id": "232247645",
            "text": "The food was great!  Salad bar was a bit over priced for what you get.  But the deep dish pizza was worth the extra cost.  The servers were friendly and welcoming and the food was reasonably priced.  I only wish there was one closer to us :)",
            "locationId": 5089668,
            "title": "Pizza was amazing",
            "rating": 4,
            "publishedDate": "2014-10-02",
            "username": "Melanie M",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "BAA6DF4F73ACE7F1685F648D5B815F84",
            "id": "226988467",
            "text": "it was very conveinient to where we stayed. the wait was a little long, but generally a good visit. Also very close to Disneyland.",
            "locationId": 5089668,
            "title": "took a little long, but generally ok.",
            "rating": 4,
            "publishedDate": "2014-09-04",
            "username": "Valerie D",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "CB05636607B0462097E7EBA904FECB4F",
            "id": "226087643",
            "text": "We tried this Shakey's while visiting Disney. We were greeted immediately with a friendly smile. Staff was very helpful and got any request we had for buffet quickly. The manager came by and check on us during our visit even though they were extremely busy. Do not go here if you want to get away from the kids at Disney, as they are a family restaurant, lots of kids running around being loud acting like kids. This is my fondest memory of Shakey's was it was a place where familys could go and have a good time.\nThe buffet was kept clean and filled and the employees were friendly and helpful. They have an arcade area for the kids and they also have a nice selection of beers on draft.",
            "locationId": 5089668,
            "title": "Great chicken and good pizza",
            "rating": 4,
            "publishedDate": "2014-09-01",
            "username": "Guido65",
            "photos": [
                {
                    "id": 108883529,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/7d/6e/49/fried-chicken.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 108883601,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/7d/6e/91/mojo-potatoes.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 108883765,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/7d/6f/35/the-shakey-s-motto.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "08E327E077446C7C70C44988F9872E77",
            "id": "217098034",
            "text": "Good pizza, not a lot o choose from, but very good. Can recommend the smoothies which was excellent. Te kids really liked the nice little gaming arcade in the restaurant.",
            "locationId": 5089668,
            "title": "Tasty pizzam fun for the kids",
            "rating": 4,
            "publishedDate": "2014-07-23",
            "username": "TriTrond",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "4F44022D2D7A836BECFAC2ED4A6E2464",
            "id": "215770353",
            "text": "We went to this location not knowing what to expect.  There are lots of option in the pizza and chicken area.  There is also a little games area for the kids to play games, get tickets and claim prizes.",
            "locationId": 5089668,
            "title": "It was okay",
            "rating": 3,
            "publishedDate": "2014-07-16",
            "username": "AlbertaJanelle",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "32103295F7319D641823E7A9D9ABFDEE",
            "id": "213562488",
            "text": "this pizza place was walking distance from hotel menage ,loved the friendly  helped us decide what we needed",
            "locationId": 5089668,
            "title": "loved the pizza",
            "rating": 5,
            "publishedDate": "2014-07-03",
            "username": "sandra284",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "048F82DE5BC500EDFCFE530626CD71ED",
            "id": "205434400",
            "text": "We visited Shakey's Pizza on a Monday the day after Easter. We went right when they had just opened for the day. We had their lunch buffet. Very good price. Pizza was delicious! A wide variety of choices. They not only had pizza but salad, chicken, pasta, steamed veggies, mashed potatoes w/gravy and their famous mojos!! Everything was nice and hot and very clean. They got really busy real quick. The worker there was going around picking up any dirty plates or trash. Very efficient. Thank you Shakey's best service ever. Oh and btw they have a nice game room the kids loved it! ",
            "locationId": 5089668,
            "title": "Best Pizza",
            "rating": 5,
            "publishedDate": "2014-05-13",
            "username": "Disneymommy09",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "35F34B18D0E9D34DA0E5A6482A800B1C",
            "id": "202271383",
            "text": "I enjoyed the food. Pizza was good, but the chicken was GREAT! my 4 year old loved the game room. Gave him something to do beside wait and grumble, thanks!",
            "locationId": 5089668,
            "title": "fun for my 4 year old",
            "rating": 4,
            "publishedDate": "2014-04-22",
            "username": "Lana P",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "DF3A01483150C0AD628197DACB68A39A",
            "id": "201412334",
            "text": "Nous n'étions jamais allés dans un Shakey's pizza et n'y retournerons plus jamais.\n\nCe restaurant est près de notre hôtel et nous y avons soupé hier soir le 15 avril 2014.\n\nOn entre et il n'y a aucun accueil et ni personne pour nous explique le fonctionnement de ce restaurant.  On ne sait pas trop quoi faire et on se dirige vers les caisses à gauche près de la cuisine.\n\nOn demande si on doit s'asseoir et comment fonctionne le restaurant pour les commandes.\n\nLa jeune fille ne peut nous répondre ce qui est bizarre et demande à une autre de venir nous éclairer.  Celle-ci nous explique rapidement et nous passons notre commande.\n\nUn numéro nous est remis et elle nous dit de se choisir une table et qu'on viendra porter nos commande directement à notre place.  Nous mettons notre numéro 83 sur la table et attendons.  Notre table était près de la cuisine et des caisses d'où une musique infernale émanait.  Le son était tellement fort que nous devions parler fort pour se comprendre.  Les employées écoutaient cette musique pour eux.  Manque total de respect pour la clientèle en ce qui nous concerne.\n\nNous croyions que nos commandes d'une petite pizza de 4 petites pointes incluant le bar à salade à volonté étaient ce que nous aurions mais une assiette de deux morceaux de poulet avec patates atterrirent sur notre table en plus de la pizza.  Rien de tout cela ne nous avait été dit.  Nous nous plaignons sur cet avis non pas du prix payé pour tout ce que nous avions mais du manque d'explication.  Nous en avions finalement pour notre argent malgré la piètre qualité de la nourriture sauf pour le bar à salade qui est plus santé.\n\nNous avons payé $8.99 chacun soit un montant total de $19.42 pour nos commandes qui se lisent ainsi sur la facture: 2 single & 2pc Leg/Th Mojo.\n\nLe concept semble populaire auprès de la population américaine mais certainement pas pour nous en tant que touristes du Québec.\n\nLa gérante était occupée avec son machin téléphonique ou autre en main et on semblait la déranger quand on lui a demandé si on pouvait changer de l'argent canadien.  La réponse fut non sans plus.\n\nNous avons quitté sans que personne ne nous adresse un sourire ou un merci pour votre visite en se promettant de ne plus jamais remettre les pieds dans cette chaîne. \n\n                      ___________________________________________________\n\nTexte rédigé le 15 avril 2014 à Anaheim, Californie.",
            "locationId": 5089668,
            "title": "Nourriture débordante de gras et accueil de piètre qualité en plus du bruit excessif.",
            "rating": 2,
            "publishedDate": "2014-04-16",
            "username": "jeduweb",
            "photos": [
                {
                    "id": 98547760,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/30/photo-du-16-avril-2014.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547761,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/31/the-day-after.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547762,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/32/chicken-full-of-fat.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547763,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/33/night-lighting.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547764,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/34/fat-chichen-plate.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547765,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/35/from-our-table.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547766,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/36/vista-desde-nuestra-mesa.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547767,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/37/night-sign.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547770,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/3a/our-2-small-pizzas.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547771,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/3b/the-only-healthy-plate.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                },
                {
                    "id": 98547887,
                    "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/df/b8/af/indigestion-nocturne.jpg?w=800&h=600&s=1",
                    "width": 800,
                    "height": 600
                }
            ],
            "language": "fr",
            "is_translated": true,
            "translation": {
                "language": "en",
                "text": "We had never gone to a Shakey's Pizza and will never go back there.\n\nThis restaurant is near our hotel and we soupped it last night on April 15, 2014.\n\nWe enter and there is no welcome and no one to explain to us how this restaurant works.We are not sure what to do and we head towards the boxes on the left near the kitchen.\n\nWe ask if we have to sit down and how the restaurant for orders works.\n\nThe girl cannot answer us what is weird and asks another to come and enlighten us.She explains to us quickly and we place our order.\n\nA number is given to us and she tells us to choose a table and we will come to carry our orders directly for us.We put our number 83 on the table and wait.Our table was close to the kitchen and the boxes from which hellish music emanated.The sound was so strong that we had to speak loudly to understand each other.The employees listened to this music for them.Total lack of respect for customers as far as we are concerned.\n\nWe believed that our commands of a small pizza of 4 small points including the unlimited salad bar were what we would have but a plate of two pieces of chicken with potatoes landed on our table in addition to the pizza.None of this had been told.We complain about this opinion not of the price paid for everything we had but of the lack of explanation.We finally had for our money despite the poor quality of the food except for the salad bar which is healthier.\n\nWe paid $ 8.99 Each or a total amount of $ 19.42 for our orders which are thus read on the invoice: 2 single & 2pc leg/th mojo.\n\nThe concept seems popular with the American population but certainly not for us as tourists from Quebec.\n\nThe manager was busy with her phone or other thing in hand and we seemed to disturb her when asked if you could change Canadian money.The answer was not nothing more.\n\nWe left without anyone sending us a smile or a thank you for your visit by promising never to set foot in this channel again.\n\n_______________________________________________\n\nText written on April 15, 2014 in Anaheim, California."
            }
        },
        {
            "userId": "6181AC8DBA0307713EFBD0EFF450BE11",
            "id": "200931612",
            "text": "The food that we were able to get on the buffet was decent but there were virtually no pizzas on the buffet the entire time that we were there.  If there was one you had to take it regardless if it was a type that you liked as that was the only option.",
            "locationId": 5089668,
            "title": "Good Food, Lack of Variety",
            "rating": 3,
            "publishedDate": "2014-04-13",
            "username": "BradleyandCole",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "6F690DFDC747539B374F212A3927F5D6",
            "id": "197327643",
            "text": "Located near the Ramada Maingate North Shakeys has one of the best pizzas ever !\nWhile it can be noisy the pizza was great. They do close by 10pm so plan accordingly.\nThe only down side was the staff was slow to clean tables and see to our needs.",
            "locationId": 5089668,
            "title": "Icredible PIZZA",
            "rating": 5,
            "publishedDate": "2014-03-13",
            "username": "KelownaBOY",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "82A5A191862A05E494CB3D115DF7FA45",
            "id": "196436199",
            "text": "I had a hard time rating this. The pizza was great but it was so crowded we had no where to sit. People would stand by dirty tables to wait for them to be cleaned so they would have a place to sit. A worker saw my lost expression and had me sit in a reserved area but told me we would have to leave at a certain time. I don't know if it is like that often as this was our first time here but it was a bit stressful. We went on a Sunday a little after noon. I'd go back for the food by might take it to go the next time.",
            "locationId": 5089668,
            "title": "Good food, no seating",
            "rating": 3,
            "publishedDate": "2014-03-06",
            "username": "MsKizz",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "632348B577BD5FDAC32B187BDF324E14",
            "id": "196352364",
            "text": "No Disneyland Vacation would be complete without eating at Shakey's at least once during your stay.  The pizza is to die for and pitchers of beer are very cold.  We used to have locations here in Vegas but gone are the good ol days.\n\nGOOD STUFF !!",
            "locationId": 5089668,
            "title": "A must stop while visiting Disneyland.",
            "rating": 5,
            "publishedDate": "2014-03-05",
            "username": "LVLAMBO",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "8DD416F4999597C81BCC8D24E6510564",
            "id": "195029994",
            "text": "Stayed next to Shakeys and havent been to Shakeys for a long time. The pizza was really good, vey busy place, but I would go back tommorrow.",
            "locationId": 5089668,
            "title": "Disneylad Trip 2014",
            "rating": 4,
            "publishedDate": "2014-02-22",
            "username": "Stormed_Norm",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "98C0172A13BB2EFAFAD94FCA0D802CA7",
            "id": "192531129",
            "text": "I had fond memories of the Lunch a Bunch buffet from many years ago and tried it today. All you can eat buffet was $7.99 ($8.36 with tax), no drink. I had fried chicken thighs (greasy and not crisp), fried mojo potatos (tough), 3 different pieces of pizza (nice selection but too salty!), macaroni (very dry with little cheese), corn (good but no butter!), and veggies (good but no butter), salad (good) with peaches and sunflower seeds. It was not at all tasty and i would not go back. Service was very good, friendly.",
            "locationId": 5089668,
            "title": "cheap but not tasty",
            "rating": 1,
            "publishedDate": "2014-01-29",
            "username": "Arnold V",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "452B4C0F8AFA95016763DCB5DCAF4941",
            "id": "191285609",
            "text": "Yes, this was good pizza, really good. Mojo potatoes rocked and the chicken was pretty good too. Could eat here every night. And did for quite a few.",
            "locationId": 5089668,
            "title": "The best pizza ever",
            "rating": 5,
            "publishedDate": "2014-01-18",
            "username": "BagmanNZ",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "B0745FA04C6ECCDBBF429BF0963E76B3",
            "id": "180939212",
            "text": "It seems this is becoming a \"regular\" hangout for us during our visits to Disneyland.  Next time we may have to try the all you can eat pizza lunch.  Dinner is a little on the pricey side, but the food is really good, and the location was convenient - just a quick drive from the hotel.",
            "locationId": 5089668,
            "title": "Love eating here",
            "rating": 4,
            "publishedDate": "2013-10-14",
            "username": "Mkyms",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "25133C182488D23035E87C21B0313C3A",
            "id": "175600573",
            "text": "They may be known for their pizza, however the fried chicken is outstanding. Pizza is tasty, atmosphere was busy, service was speedy.",
            "locationId": 5089668,
            "title": "Awesome chicken",
            "rating": 4,
            "publishedDate": "2013-09-03",
            "username": "Djsahn65",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "092FEBF4DEC227B01A9D3D35F54B7047",
            "id": "172204808",
            "text": "Hadn't been to a Shakey's in 18 years(?).  The food wasn't anything special was surprised they actually had chicken.  Since I wasn't needing to eat much I ordered the two piece and it was decent.  Thought the atmosphere was good, I just needed a big table to do some paperwork/ training review.  Worked out perfect.  ",
            "locationId": 5089668,
            "title": "Shakey's serves chicken?",
            "rating": 4,
            "publishedDate": "2013-08-14",
            "username": "Itz_Showtime",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "1E82AA712E545D4F82F49A01032E44F0",
            "id": "169248685",
            "text": "Its alot smaller than what I thought it was going to be. But nonetheless I had a positive experience. Its pretty close to Disneyland as well. ",
            "locationId": 5089668,
            "title": "Small-ish",
            "rating": 5,
            "publishedDate": "2013-07-26",
            "username": "johnjcm",
            "photos": [],
            "language": "en",
            "is_translated": false
        },
        {
            "userId": "5439AD1386AC37753A75537AB88AE550",
            "id": "156613808",
            "text": "Food and service was great! we got a mushroom pizza and a pepperoni and sausage pizza AND mojo's. Mojo's were absolutely DELISH!!!! Really close to Disneyland so we left the park to go have dinner there and then went back to DL. Would definitely go back next time we're in town. :)",
            "locationId": 5089668,
            "title": "Yummy!",
            "rating": 4,
            "publishedDate": "2013-04-04",
            "username": "mguerra602",
            "photos": [],
            "language": "en",
            "is_translated": false
        }
    ],
    "restaurant": {
        "name": "Shakey's Pizza Parlor",
        "description": null,
        "telephone": "+1 714-533-0442",
        "localizedRealtimeAddress": "1027 S Harbor Blvd, Anaheim, CA 92805",
        "schedule": {
            "sun": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "mon": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "tue": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "wed": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "thu": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "fri": [
                {
                    "close_time": "23:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "sat": [
                {
                    "close_time": "23:00:00",
                    "open_time": "11:00:00"
                }
            ]
        },
        "url": "R1ZGX2h0dHBzOi8vd3d3LnNoYWtleXMuY29tL2xvY2F0aW9ucy9vcmFuZ2UvYW5haGVpbS1yZXN0YXVyYW50L19Ecmw=",
        "decoded_url": "https://www.shakeys.com/locations/orange/anaheim-restaurant/",
        "dining_options": [
            "Takeout",
            "Reservations",
            "Seating",
            "Parking Available",
            "Television",
            "Highchairs Available",
            "Wheelchair Accessible",
            "Serves Alcohol"
        ],
        "cuisines": [
            "American",
            "Pizza"
        ],
        "meal_types": [
            "Lunch",
            "Dinner"
        ],
        "menu": {
            "has_provider": false,
            "menu_url": "dXJBX2h0dHBzOi8vd3d3LnNoYWtleXMuY29tL21lbnUvcGl6emEvX3VuRQ==",
            "decoded_menu_url": "https://www.shakeys.com/menu/pizza/"
        }
    },
    "location": {
        "locationId": 5089668,
        "name": "",
        "placeType": "EATERY",
        "url": "/Restaurant_Review-g29092-d5089668-Reviews-Shakey_s_Pizza_Parlor-Anaheim_California.html",
        "topicCount": 1,
        "reviewSummary": {
            "alertStatusCount": 0,
            "rating": 3.9,
            "count": 121
        },
        "reviewAggregations": {
            "ratingCounts": [
                7,
                6,
                17,
                50,
                41
            ],
            "languageCounts": {
                "pt": 1,
                "ja": 2,
                "en": 116,
                "pl": 1,
                "fr": 1
            }
        },
        "localizedStreetAddress": {
            "city": "Anaheim",
            "state": "California",
            "postalCode": "92805",
            "street1": "1027 S Harbor Blvd",
            "street2": null
        },
        "isoCountryCode": "US",
        "parent": {
            "locationId": 29092,
            "localizedName": "Anaheim"
        },
        "email": "contactus@shakeys.com",
        "thumbnail": {
            "url": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/98/f2/f7/large-pan-pizza-with.jpg?w=800&h=600&s=1",
            "width": 800,
            "height": 600,
            "original_width": 4032,
            "original_height": 3024
        }
    }
}