{
    "reviews": [
        {
            "userId": "1379DBEE1798F18B1D58FF6B0681F853",
            "id": 974393598,
            "text": "I don't live anywhere near a Shakey's so I took the opportunity to eat here on a recent Disneyland trip. It's a short walk from Disneyland and conveniently located near lots of hotels.\n\nShakey's is the first franchise pizza chain in the United States and has some cool history behind it. The pizza was good. They've got your standard variety but also several more unique pizzas. My son amd I each got our own small pizzas and both turned out good. \n\nThey were busy (lots of Disney folks coming in) but we got our food pretty quickly. I would eat here again when visiting Disneyland.",
            "locationId": 5089668,
            "title": "Good Pizza, Quick Walk From Disneyland",
            "rating": 5,
            "publishedDate": "2024-10-18",
            "username": "Travis G"
        },
        {
            "userId": "A08C3745B152AC9D129C0E7A254FA5AD",
            "id": 942831450,
            "text": "Store #052  @5:01 PM\n\nOur second visit over our holiday weekend. Busy place, that was a good sign for popularity equaling good food. The wait was off set by the shifts manager stepping up to make our visit better. Her excellent service, helpfulness & attitude made the 40 min wait for our pizza worth it.  She even offered a free side dish. That is what can make or break the chance of returning customers. Well Done.",
            "locationId": 5089668,
            "title": "Second time is the charm",
            "rating": 5,
            "publishedDate": "2024-03-18",
            "username": "DukeClay"
        },
        {
            "userId": "E2BE06BB8B4A6A97C39C0BDEA20AF62C",
            "id": 905130967,
            "text": "Okay. So I've been coming here every time we go on vacation to Disneyland, it's one of our favorite spots, service is top notch, food  taste the same as when I was a kid and the pizza, fried chicken and mojos (potato wedges) are super good. Today I was reminded that I should write a review about my experience with them, so that's exactly what I'm doing. Thanks \"Sandra\" for reminding me, hope this helps spread the word about Shakeys! Always 5 Stars",
            "locationId": 5089668,
            "title": "Classic!",
            "rating": 5,
            "publishedDate": "2023-07-23",
            "username": "True916"
        },
        {
            "userId": "6B3FAD5CE4DB444C1C7E1F2A9128CA77",
            "id": 803954809,
            "text": "I have a been of Shakey's since I was a kid, and we had one near us which kept us in pizza for years. Now, it's gone and when I find a Shakey's somewhere where I am travelling I try to stop by for a revisit to my youth.\n\nI have been to this location before, as it is convenient to the hotels I stay at while in Anaheim. It is an easy to get to location, just off I-5 and Ball, with good parking and lots of room inside! Tonight the parking lot was getting full but there were plenty of tables inside in  spite of families, groups and couples enjoying a pizza night this Saturday. \n\nThe place is moving with business, and ordering took about a 5 minute wait - not too b ad considering. I was surprise to see the salad bar back! I haven't seen one of those anywhere since COVID hit! A nice surprise, which I took advantage of along with ordering a small vegetarian pizza. \n\nThe plate for the salad is about the size of a side salad, and for $7.99 I figure I needed two go-arounds to get my money's worth! It is all you can eat, so don't feel guilty going back. The lettuce was fresh and plentiful, with a choice of toppings that were basic - croutons, beets and olives, peaches, red onions, pepperoncini, and similar. But the sliced mushrooms were out, there were no tomatoes or cucumbers, so not everything I like was there. The dressings were filled, and I lava flowed the blue cheese over my salad. \n\nThey bring your order to the table, and when I was getting my second plate the pizza arrived. It took 26 minutes from ordering, but I was still on my salad so was not a distraction to me. I think that is a reasonable time for a busy night.\n\nThe drinks are self-serve, but both machines were out of ice! Oyyy. Not sure why, they seemed large  enough but I guess ice was the rage that night.\n\nI liked the pizza (original thin of course!) and the salad was nice - I hadn't had a salad in a while.  The young man taking the order was very nice, and the young lady who ran my pizza to my table came back after I had returned from the salad bar and was good enough to ask if I needed a plate - she could have just left the pizza and been done with me. \n\nIt was good to see them cleaning tables pretty quickly, and even giving the drink station a good cleaning and replenishment of straws and stuff.\n\nThe game arcade was really popular with kids and teens, too - it was the place of fun and luck. \n\nOverall a very good meal, and a reminder of why Shakey's is one of my favorites!",
            "locationId": 5089668,
            "title": "Very good dinner!",
            "rating": 4,
            "publishedDate": "2021-08-15",
            "username": "Mister-Markie"
        },
        {
            "userId": "6DF989B552660D9991942E958E251FD7",
            "id": 752597180,
            "text": "The food was nice and hot and tasty as ever! We ordered the combo pepperoni pizza mojos and chicken.   The salad bar is too expensive for what they offer.",
            "locationId": 5089668,
            "title": "Chicken Pizza and Mojos soooo delicious but the salad bar is too expensive",
            "rating": 4,
            "publishedDate": "2020-04-13",
            "username": "MA9703"
        },
        {
            "userId": "2AD68D8410DD84A4C23E4D977BD04073",
            "id": 743736865,
            "text": "Gluten-free Pizza No Go\n\nHe grew up on Shakey’s on Beach Blvd in La Habra with gay 1890s theme, silent B/W movies, cracker-like crust, and player piano. She few up in Sacramento where Shakey’s originated. Neither of us knew there were any still around. \n\nCalled in advance to confirm that they had gluten-free pizza crust. They said yes and suspiciously in all sizes. However, when we called back to order a pizza they said they do not offer a gluten-free crust at all. \n\nSo we got our gluten-free medium pizza from nearby Carolina’s instead. They say you can never go Home. Guess not. Too bad. ",
            "locationId": 5089668,
            "title": "Gluten-free Pizza No Go",
            "rating": 1,
            "publishedDate": "2020-02-08",
            "username": "NomadikCulture"
        },
        {
            "userId": "503A229882DA6B41E3098178A9520AA6",
            "id": 740276750,
            "text": "Chicken and mojo's are the saving grace here. Pizza is average at best. There's a small arcade for the  kids and beer for the adults. A lot of seating...",
            "locationId": 5089668,
            "title": "Good if you have kids - food is average",
            "rating": 3,
            "publishedDate": "2020-01-20",
            "username": "PROROB68"
        },
        {
            "userId": "E0C241ED99B2526EFDB2E930CE8E7B73",
            "id": 736032554,
            "text": "you will love the price and they have chicken and mash potatoes and gravy, really good with a great atmosphere",
            "locationId": 5089668,
            "title": "this is a great place to go to",
            "rating": 5,
            "publishedDate": "2020-01-01",
            "username": "markrs44mag"
        },
        {
            "userId": "D2B991E9F95E6F1362FEDB4D81431998",
            "id": 726029370,
            "text": "Tem uma boa variedade de produtos, que são muito bem servidos. Atendimento meia boca, mas a gente releva...  pode ser uma diferença cultural",
            "locationId": 5089668,
            "title": "Bem servido",
            "rating": 4,
            "publishedDate": "2019-11-12",
            "username": "Cristiane C"
        },
        {
            "userId": "144866E758479C07AEC5F13514C5EFE9",
            "id": 712822583,
            "text": "I have not been to a Shakey's in over 20 years when they closed on the East Coast.  Shakey's did not disappoint.  It's not the greatest pizza but it is good and quick.  It's a great place for the family.",
            "locationId": 5089668,
            "title": "Still a good place for good pizza.",
            "rating": 4,
            "publishedDate": "2019-09-25",
            "username": "John S"
        },
        {
            "userId": "9423AD9D97DC350A8A34AF167170C3D1", 
            "id": 697394639,
            "text": "日本では昔良く利用させて頂いたシェーキーズですが、今回初めてアメリカで食べました。\n\nたまたま宿泊したモーテルの真横がお店だったので。日本のお店と違って味がとても濃くて中々美味しかったです！",
            "locationId": 5089668,
            "title": "久々に シェーキーズでご飯",
            "rating": 4,
            "publishedDate": "2019-08-09",
            "username": "m2miffy"
        },
        {
            "userId": "734D36BFFFF10516F16CCA9D267FF59B",
            "id": 696070433,
            "text": "Good pizza. I had a thin dough one, but the thick looked very appetising. Toppings were generous and dough was crispy. Friendly staff and fast service. A nice experience ",
            "locationId": 5089668,
            "title": "Good pizza",
            "rating": 4,
            "publishedDate": "2019-08-06",
            "username": "patrikc333"
        },
        {
            "userId": "B84878D616BEB3C92AE605E6BF95C87A",
            "id": 690749286,
            "text": "We used to love going to Shakey's for their lunch buffet. Shakey's is no longer in our town. So we loved the opportunity to try it again. We ordered the Mojo Potatoes, Fried Chicken, and Pizza. The Mojo Potatoes used to be our favorite, and they are still as good as they have always been-excellent. Fried Chicken-Excellent. Pizza was very good. The Service was excellent. The Restaurant was in excellent shape. This will be a go to place when we come back to Anaheim.",
            "locationId": 5089668,
            "title": "Visited an Old Favorite",
            "rating": 5,
            "publishedDate": "2019-07-18",
            "username": "Don P"
        },
        {
            "userId": "9BE83C1A91F9B2D02AE6644AD7E79A34",
            "id": 663293067,
            "text": "The employees were friendly. Recommend the buffet. Great price for all the food. Buffet had pizza and pasta!",
            "locationId": 5089668,
            "title": "Great Food and Service!",
            "rating": 5,
            "publishedDate": "2019-04-02",
            "username": "jpjim2019"
        },
        {
            "userId": "83354D2DDDAD2C831588AE1C1DDA412E",
            "id": 660993735,
            "text": "We no longer have a Shakey's in our area. When ever we come to Southern California we look forward to the \"Bunch a Lunch\" Pizza, fried chicken, mojo potatoes, mac & cheese, salad bar... My favorite is the dessert pizza Pies.",
            "locationId": 5089668,
            "title": "Yaa Shakey's",
            "rating": 5,
            "publishedDate": "2019-03-25",
            "username": "lilnetjojocoxon"
        }
    ],
    "restaurant": {
        "name": "Shakey's Pizza Parlor",
        "description": null,
        "telephone": "+1 714-533-0442",
        "localizedRealtimeAddress": "1027 S Harbor Blvd, Anaheim, CA 92805",
        "schedule": {
            "sun": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "mon": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "tue": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "wed": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "thu": [
                {
                    "close_time": "22:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "fri": [
                {
                    "close_time": "23:00:00",
                    "open_time": "11:00:00"
                }
            ],
            "sat": [
                {
                    "close_time": "23:00:00",
                    "open_time": "11:00:00"
                }
            ]
        }
    },
    "location": {
        "localizedStreetAddress": {
            "city": "Anaheim",
            "state": "California",
            "postalCode": "92805",
            "street1": "1027 S Harbor Blvd",
            "street2": null
        },
        "isoCountryCode": "US",
        "parent": {
            "locationId": 29092,
            "localizedName": "Anaheim"
        },
        "email": "contactus@shakeys.com"
    }
}